sys/212.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
            &lt;SYSMessage&gt;&#xD;
            &lt;messageGuid value="<%=messageGuid %>" /&gt;
            &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="212" value="Bebek / Cocuk Psikososyal Izlem Veri Seti" /&gt;
            &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
            &lt;author&gt;
            &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                &lt;/author&gt;
        &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
            &lt;recordData&gt;
            &lt;BEBEK_COCUK_IZLEM_PSIKOSOSYAL_IZLEM&gt;
                        <% for(var i=0; i < GELISIM_TABLOSU_BILGILERININ_SORGULANMASI.length; i++) {%>
                            &lt;GELISIM_TABLOSU_BILGILERININ_SORGULANMASI version="1" codeSystemGuid="b0f8712e-a51b-427a-a554-a21574abb07b" code="<%=GELISIM_TABLOSU_BILGILERININ_SORGULANMASI[i].KODU %>" value="<%=GELISIM_TABLOSU_BILGILERININ_SORGULANMASI[i].ADI %>" /&gt;
                        <% }%>

                        <% for(var i=0; i < BEBEGIN_COCUGUN_BEYIN_GELISIMINI_ETKILEYEBILECEK_RISKLER.length; i++) {%>
                            &lt;BEBEGIN_COCUGUN_BEYIN_GELISIMINI_ETKILEYEBILECEK_RISKLER version="1" codeSystemGuid="c81e3e71-8c22-4363-af86-3b687c91b063" code="<%=BEBEGIN_COCUGUN_BEYIN_GELISIMINI_ETKILEYEBILECEK_RISKLER[i].KODU %>" value="<%=BEBEGIN_COCUGUN_BEYIN_GELISIMINI_ETKILEYEBILECEK_RISKLER[i].ADI %>" /&gt;
                        <% }%>
                        <% for(var i=0; i < EBEVEYNIN_PSIKOLOJIK_GELISIMI_DESTEKLEYICI_AKTIVITELERI.length; i++) {%>
                            &lt;EBEVEYNIN_PSIKOLOJIK_GELISIMI_DESTEKLEYICI_AKTIVITELERI version="1" codeSystemGuid="3e30ff47-ed6f-425c-b099-5a4a8121fa10" code="<%=EBEVEYNIN_PSIKOLOJIK_GELISIMI_DESTEKLEYICI_AKTIVITELERI[i].KODU %>" value="<%=EBEVEYNIN_PSIKOLOJIK_GELISIMI_DESTEKLEYICI_AKTIVITELERI[i].ADI %>" /&gt;
                        <% }%>

                        <%if(BEBEGIN_COCUGUN_PSIKOLOJIK_GELISIMINDEKI_RISKLERE_YONELIK_EGITIMLER!=-1){ %>
                            <% for(var i=0; i < BEBEGIN_COCUGUN_PSIKOLOJIK_GELISIMINDEKI_RISKLERE_YONELIK_EGITIMLER.length; i++) {%>
                                &lt;BEBEGIN_COCUGUN_PSIKOLOJIK_GELISIMINDEKI_RISKLERE_YONELIK_EGITIMLER version="1" codeSystemGuid="58078833-09f4-4046-883e-81777a548af0" code="<%=BEBEGIN_COCUGUN_PSIKOLOJIK_GELISIMINDEKI_RISKLERE_YONELIK_EGITIMLER[i].KODU %>" value="<%=BEBEGIN_COCUGUN_PSIKOLOJIK_GELISIMINDEKI_RISKLERE_YONELIK_EGITIMLER[i].ADI %>" /&gt;
                            <% }%>
                        <%} %>
                        <%if(BEBEGIN_COCUGUN_RISK_FAKTORLERINE_YAPILAN_MUDAHALE!=-1){ %>
                            <% for(var i=0; i < BEBEGIN_COCUGUN_RISK_FAKTORLERINE_YAPILAN_MUDAHALE.length; i++) {%>
                                &lt;BEBEGIN_COCUGUN_RISK_FAKTORLERINE_YAPILAN_MUDAHALE version="1" codeSystemGuid="27f5f375-1755-4d5b-ba13-0b0f6817bfa5" code="<%=BEBEGIN_COCUGUN_RISK_FAKTORLERINE_YAPILAN_MUDAHALE[i].KODU %>" value="<%=BEBEGIN_COCUGUN_RISK_FAKTORLERINE_YAPILAN_MUDAHALE[i].ADI %>" /&gt;
                            <% }%>
                        <%} %>
                        <%if(BEBEK_COCUKTA_SIK_IZLEME_ALINAN_RISK_ALTINDAKI_OLGUNUN_TAKIBI!=-1){ %>
                            <% for(var i=0; i < BEBEK_COCUKTA_SIK_IZLEME_ALINAN_RISK_ALTINDAKI_OLGUNUN_TAKIBI.length; i++) {%>
                                &lt;BEBEK_COCUKTA_SIK_IZLEME_ALINAN_RISK_ALTINDAKI_OLGUNUN_TAKIBI version="1" codeSystemGuid="9d81738b-2e2d-4251-b397-34dfb014dc9b" code="<%=BEBEK_COCUKTA_SIK_IZLEME_ALINAN_RISK_ALTINDAKI_OLGUNUN_TAKIBI[i].KODU %>" value="<%=BEBEK_COCUKTA_SIK_IZLEME_ALINAN_RISK_ALTINDAKI_OLGUNUN_TAKIBI[i].ADI %>" /&gt;
                            <% }%>
                        <%} %>


            &lt;/BEBEK_COCUK_IZLEM_PSIKOSOSYAL_IZLEM&gt;

            &lt;HASTA_TAKIP_BILGISI&gt;
                      &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
            &lt;/HASTA_TAKIP_BILGISI&gt;
   
                        &lt;/recordData&gt;&#xD;
                        &lt;/SYSMessage&gt;&#xD;
                    </input>
                </SYSSendMessage>
                </s:Body>
        </s:Envelope>                   
                                            
            